# В v0.1 була проблема в 6 та 19 рядку.6 рядок - треба розділяти формулу душками якщо виконується дія множення.
# 19 рядок - там був else тому якщо результат ІМТ калькулятор дорівнював менше 40 то він писав що вага в нормі.
print("Вас вітає ІМТ v0.2!")
weight=float(input("Яка у вас вага тіла (кг)?:"))
height=float(input("Який у вас зріст (см)?:"))
print("Добре розпочинаю вираховувати результат ІМТ...")
bmi = weight/((height/100)*(height/100))
for loading in range (1, 100):
    print(loading)
print("Ваш ІМТ дорвінює", bmi)
print("Йде оцінювання вашого результату ІМТ..")
if bmi>=15 and bmi <= 25:
    print("Ваша вага в нормі!")
if bmi>=25 and bmi<=30:
    print("У вас зайва вага!")
if bmi>=30 and bmi<=35:
    print("У вас ожиріння першого ступення!!")
if bmi>=35 and bmi<=40:
    print("У вас ожиріння другої ступення!!!")
if bmi>=40:
    print("У вас ожиріння третього ступення (морбідне)!!!!!")
print("Дякую за використання калькулятора ІМТ v0.2!")